Documents/СкорингДолговыхОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СкорингДолговыхОбязательств</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>ChartOfCharacteristicTypes.ВидыСкоринга</xr:Item>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СостоянияПоКатегориям</xr:Item>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скоринг</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Категории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияСтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Категории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ОбъектыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ОбъектыУчета</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиПоДоговорам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СкорингДолговыхОбязательств/Forms/ФормаДокумента/Ext/Form/Module.bsl
Процедура УстановитьВидимостьДО()
	// Если ЕжедневныйСкоринг И Объект.ВидОперации = Перечисления.ВидыДеятельностиОтделов.ВзысканиеЗадолженности Тогда
	//	Элементы.РаспределениеДО.ПодчиненныеЭлементы.РаспределениеДОДолговоеОбязательство.Видимость=Истина;
	//Иначе
	//	Элементы.РаспределениеДО.ПодчиненныеЭлементы.РаспределениеДОДолговоеОбязательство.Видимость=Ложь;
	//КонецЕсли;         
КонецПроцедуры

Процедура УстановитьВидимость()
	//Колонки = Элементы.РаспределениеДО.Колонки;
	////Элементы.РаспределениеДОДолговоеОбязательство.Видимость = 
	////		(Объект.Скоринг.ВидДеятельностиОтдела <> Перечисления.ВидыДеятельностиОтделов.ВзысканиеЗадолженности);
	////Элементы.РаспределениеДОИсполнительныйЛист.Видимость = 
	////		(Объект.Скоринг.ВидДеятельностиОтдела = Перечисления.ВидыДеятельностиОтделов.РаботаССудебнымиПриставами);	
КонецПроцедуры

&НаКлиенте
Процедура Распределить(Команда)
	РаспределитьСервер();	
	//ЗаполнитьТаблицуНастроекДействий();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура РаспределитьСервер()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РаспределитьСервер();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
КонецПроцедуры 

Функция ПроверкаКорректныхПараметров(КомпоновщикНастроек);
	Успех = Истина;
	Для Каждого Параметр Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если ЗначениеЗаполнено(Параметр.Значение) Тогда
			Продолжить;		
		ИначеЕсли Строка(Параметр.Параметр) = "Период" 
			или Строка(Параметр.Параметр) = "BeginOfPeriod" 
			или Строка(Параметр.Параметр) = "EndOfPeriod" Тогда
			Продолжить;		
		КонецЕсли;
		
		Сообщить("	В скоринге: " + Объект.Скоринг + ", не заполнен параметр " + Параметр.Параметр, 
				СтатусСообщения.Внимание); 
		Успех = Ложь;
	КонецЦикла;
	
	ОбнаруженаОшибка = Не Успех;
	Возврат Успех;
КонецФункции

Процедура ПодборВтаблЧасть(Результат)
	Об = РеквизитФормыВЗначение("Объект");	
	Если Объект.Скоринг.ОбъектУчета = Перечисления.ОбъектыУчета.Контрагенты Тогда
		Результат.Таблица.Свернуть("Должник");
	КонецЕсли; 	
	РаботаСДокументами.ЗанестиРезультатПодбораВТабличнуюЧасть(Об.Объекты, Результат);
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроведения(Команда)
	//ПровестиДокумент();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПровестиИЗакрыть(Команда)
	//Если ПровестиДокумент() Тогда
	//	Закрыть();
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьДокумент(РежимЗаписи)
	Документ = РеквизитФормыВЗначение("Объект");	
	Попытка
		Документ.Записать(РежимЗаписи);
		ЗначениеВРеквизитФормы(Документ, "Объект");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
	Элементы.ОбъектыПодборПоНастройкам.Видимость = Константы.ИспользоватьНастройкиПодбораОбъектовУчета.Получить();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	Объект.Объекты.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
КонецПроцедуры
